Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/working_in_ireland/coming_to_work_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Coming to work in Ireland
ga: Ag teacht go hÉirinn chun oibriú

source: If you intend to come to work in Ireland you need to know the rules about the formalities involved in travelling to Ireland, the rules about permission to land in Ireland
ga: Má tá sé beartaithe agat teacht chun oibriú in Éirinn, caithfidh tú a bheith ar an eolas faoi ghnásanna a bhaineann le taisteal go hÉirinn, agus na rialacha faoi chead tuirlingthe in Éirinn

source: It would be helpful to know general information about who is entitled to come to Ireland and about living in Ireland before you come here
ga: Bheadh sé cabhrach faisnéis ghinearálta a bheith ar eolas faoi na daoine atá i dteideal teacht go hÉirinn agus faoi chónaí in Éirinn sula dtagann tú anseo

source: You may find out about job vacancies and how to begin the process of finding a job in Ireland
ga: Is féidir leat fáil amach faoi fholúntais in Éirinn agus conas an próiseas a thosú maidir le post a aimsiú in Éirinn

source: Citizens of certain countries need a visa in order to come to Ireland
ga: Tá víosa chun teacht go hÉirinn de dhíth ar shaoránaigh ó thíortha áirithe

source: You must apply for an Irish visa online
ga: Caithfidh tú iarratas a dhéanamh ar víosa Éireannach ar líne

source: A visa does not confer any right to live or work in Ireland
ga: Ní bhronnann víosa ceart cónaithe nó ceart oibre ar bith in Éirinn

source: If you are from an EU member state or one of the countries of the EEA or Switzerland, you are entitled to come to work in Ireland
ga: Saoránaigh LEE nó na hEilvéise: Más as ballstát AE nó ceann de thíortha LEE nó an Eilvéis, thú, tá tú i dteideal teacht chun oibriú in Éirinn

source: You do not need an employment permit
ga: Níl cead fostaíochta de dhíth ort

source: You are entitled to have your dependants come to live with you
ga: Tá tú i dteideal go dtiocfadh do chleithiúnaithe chun cónaí leat

source: If your non-EEA spouse or civil partner is coming to live in Ireland with you, they must apply for permission to remain under EU Treaty Rights in order to have similar rights to live and work in Ireland
ga: Má tá do chéile nó páirtnéir sibhialta neamh-LEE ag teacht go hÉirinn chun bheith ina chónaí leat, caithfidh siad iarratas ar Chearta Conartha AE a dhéanamh um chearta comhchosúla cónaithe agus oibre a fháil

source: If you are an EEA or Swiss national, you are entitled to be treated in the same way as Irish citizens when you apply for work in Ireland
ga: Más náisiúnach LEE nó na hEilvéise tú, tá tú i dteideal go pléifear leat ar an gcaoi chéanna le saoránaigh na hÉireann nuair a dhéanann tú iarratas ar obair in Éirinn

source: You are free to apply for any job vacancy, including jobs in the public sector
ga: Tá saorchead agat iarratas a dhéanamh ar fholúntas ar bith, ina áirítear poist san earnáil phoiblí

source: These include jobs in the Irish army and the Irish police force (An Garda Síochána), but not the Irish diplomatic service
ga: Áirítear ina measc seo poist in Arm na hÉireann agus fórsa póilíneachta na hÉireann (An Garda Síochána), ach ní áirítear poist i seirbhís taidhleoireachta na hÉireann

source: There is a system of mutual recognition of qualifications between the EEA countries
ga: Tá córas i bhfeidhm maidir le comhaitheantas na gcáilíochtaí idir thíortha LEE

source: If you are from another country then generally you need an employment permit
ga: Tíortha eile: Go ginearálta, beidh cead fostaíochta de dhíth ort más ó thír eile tú

source: There are 9 different employment permits – see ‘Employment permits’ below
ga: Tá 9 chineál ceadanna fostaíochta - féach 'Ceadanna fostaíochta' thíos

source: Highly Skilled Job Interview Authorisation: Non-EEA nationals who have been invited to attend an interview for employment on the Highly Skilled Occupations list, will be granted a Highly Skilled Job Interview Authorisation allowing them to remain Ireland for a maximum of 90 days
ga: Údarú um Agallamh Poist Ardoilte: Má thugtar cuireadh do náisiúnach neamh-LEE agallamh maidir le fostaíocht sa Liosta na nGairmeacha Ardoilte a fhreastal, tabharfar é Údarú um Agallamh Poist Ardoilte a cheadaítear é fanacht ar feadh uasmhéid 90 lá

source: Who does not need an employment permit?
ga: Cén daoine nach bhfuil cead fostaíochta de dhíth orthu?

source: You do not need an employment permit in order to work legally in Ireland if you are in one of the following categories:
ga: Níl cead fostaíochta de dhíth ort chun oibriú go dleathach in Éirinn, má tá tú i gceann de na catagóirí a leanas:

source: • Citizens of the EEA member states and Switzerland, and their spouses, civil partners and dependants (regardless of their nationality)
ga: • Saoránaigh de bhallstáit LEE agus an Eilvéis, agus a gcéilí, páirtnéirí sibhialta agus cleithiúnaithe (is cuma a náisiúntacht)

source: • People who have been granted refugee status in Ireland
ga: • Daoine a deonaíodh stádas dídeanaithe dóibh in Éirinn

source: • People who have been refused refugee status but have been given permission to remain on humanitarian grounds
ga: • Daoine a diúltaíodh stádas dídeanaithe dóibh, ach a tugadh dóibh cead fanachta ar chúiseanna daonnúlla

source: • People who have been given permission to remain because they are the spouse, civil partner or parent of an Irish citizen
ga: • Daoine a tugadh cead fanachta dóibh toisc gur céile, páirtnéir sibhialta nó tuismitheoir de shaoránach Éireannach iad

source: • Postgraduate students where the work is an integral part of the course of study being undertaken
ga: • Mic léinn iarchéime ina bhfuil an obair mar chuid lárnach den chúrsa staidéir atá á chomhlíonadh acu

source: • Non-EEA nationals carrying out scientific research for an approved research organisation
ga: • Beidh náisiúnaigh neamh-LEE atá déanamh taighde eolaíoch d'eagraíocht taighde fhaofa i gceist

source: • The Van der Elst process generally allows a non-EEA national, legally employed by a company in an EU country, to provide services on a temporary basis to a company in another EU country on behalf of his/her employer without the need to obtain an employment permit
ga: • Go ginearálta, ceadaíonn an próiseas Van Elst náisiúnach neamh-LEE, atá fostaithe ag gnó i dtír AE, chun seirbhísí ar son a fhostóir do ghnó i dtír AE eile ar bhonn sealadach a sholáthar gan ghá cead oibre a fháil

source: • The Atypical Working Scheme allows eligible non-EEA nationals to do certain short-term contract work in Ireland
ga: • Faoin scéim Obair Neamhthipiciúil ceadaítear náisiúnaigh neamh-LEE incháilithe (pdf) obair conartha gearrthéarmach áirithe in Éirinn a dhéanamh

source: If you are from a country whose nationals normally require an employment permit and you are studying in Ireland on an approved course, you may take up casual work – a maximum of 20 hours a week in term time and full time during the holidays – without an employment permit
ga: Más ó thír tú ina mbíonn cead fostaíochta de dhíth go hiondúil agus tú ag staidéar in Éirinn ar chúrsa faofa, is féidir leat a bheith i mbun corrfhostaíochta – uasmhéid de 20 uair in aghaidh na seachtaine i rith an téarma agus lánaimseartha le linn na laethanta saoire – gan cead fostaíochta

source: The Third Level Graduate Scheme (pdf) allows non-EEA students who have graduated on or after 1 January 2007 with a level 7 degree to remain in Ireland for 6 months
ga: Ceadaíonn an Scéim Iarchéime Tríú Leibhéal (pdf) do mhic léinn neamh-LEE a bhain céim amach ar an 1 Eanáir 2007 nó ina dhiaidh, le bunchéim leibhéal 7, fanacht in Éirinn ar feadh 6 mhí

source: Those with a degree at levels 8-10 can remain for 12 months
ga: Má tá céim leibhéil 8-10 acu tá fanacht in Éirinn ar feadh 12 mhí ceadaithe

source: This allows them to find employment and apply for a General or Critical Skills Employment Permit
ga: Ansin is féidir leo fostaíocht a aimsiú agus iarratas a dhéanamh ar Chead Scileanna Ríthábhachtacha nó Ginearálta

source: Working holiday authorisations may be issued to nationals of Canada, Australia, New Zealand, Japan, Argentina, Chile, Hong Kong, USA, Taiwan and South Korea as part of a reciprocal agreement between these countries and Ireland
ga: D'fhéadfaí údaruithe um shaoire oibre a eisiúint go náisiúnaigh Cheanada, na hAstráile, na Nua-Shéalainne, na Seapáine, na hAirgintíne, an tSile, Hong Cong, Stáit Aontaithe, an Téaváin agus na Cóire Theas mar chuid de chomhaontú cómhalartach idir na tíortha seo agus Éire

source: If you are on a working holiday authorisation you are not permitted to transfer over to a General Employment Permit
ga: Má tá tú ar údarú um shaoire oibre, ní cheadaítear aistríu go cead fostaíochta

source: There are general rules which apply to all employment permits
ga: Tá rialacha ginearálta ann a bhaineann le gach cead fostaíochta

source: Since 1 October 2014, there are 9 types of employment permit
ga: Ó 1 Meán Fómhair 2014, tá 9 saghas de chead fostaíochta ann

source: They include the Critical Skills Employment Permit for highly skilled workers and the General Employment Permit which have replaced the work permit and Green Card permit respectively
ga: Áirítear an Cead Fostaíochta Scileanna Ríthábhachtacha d’oibrithe scileanna sainiúla agus an Cead Fostaíochta Ginearálta a chuireadh in áit an Cárta Glas agus an Cead Fostaíochta faoi seach

source: Either the prospective employee or prospective employer may apply for the permit – see 'How to apply' below
ga: D'fhéadfadh ceachtar den bhfostaí ionchasach nó fostóir ionchasach iarratas a dhéanamh ar chead – féach 'Conas iarratas a dhéanamh' thíos

source: Refusal of employment permit: If you are refused an employment permit, you may ask for an internal review
ga: Cead fostaíochta diúltaithe: Má dhéantar cead fostaíochta a dhiúltú duit, d'fhéadfá athbhreithniú inmheánach a lorg

source: You should ask for a review within 21 days of being notified of a refusal
ga: Ba chóir duit athbhreithniú a lorg laistigh de 21 lá ón bhfógra diúltaithe

source: Employers who want to employ people who need employment permits have to meet certain requirements
ga: Caithfidh fostóirí atá ag iarraidh daoine a fhostú a bhfuil ceadanna fostaíochta de dhíth orthu, riachtanais áirithe a shásamh roimh ré

source: They must be legally trading in Ireland – this means they must be registered with Revenue and with the Companies Registration Office (CRO) if the employer is a company
ga: Caithfidh siad a bheith ag trádáil go dleathach in Éirinn – ciallaíonn sé seo a bheith cláraithe leis na Coimisinéirí Ioncaim agus le hOifig um Chlárú Cuideachtaí (OCC) más cuideachta atá sa bhfostóir

source: You can check the registration at the CRO at cro.ie
ga: Is féidir cúrsaí cláraithe san OCC a sheiceáil ag cro.ie

source: The employer must employ you directly – this means that applications from recruitment agencies, agents, intermediaries or companies who intend to outsource or subcontract you to work in another company are not accepted
ga: Caithfidh an fostóir tú a fhostú go díreach – ciallaíonn sé seo nach bhfuil an méid a leanas inghlactha – iarratais ó ghníomhaireachtaí earcaíochta, ghníomhairí, idirghabhálaithe nó chuideachtaí a bhfuil sé beartaithe acu tú a úsáid ar fochonradh nó foinsiú allamuigh, chun oibriú i gcuideachta eile

source: Employees who have employment permits are obliged to abide by the immigration rules
ga: Tá dualgas ar fhostaithe le ceadanna fostaíochta cloí leis na rialacha inimirce

source: This means that you may need a visa in order to come here and you must register with the immigration authorities
ga: Ciallaíonn sé seo go bhféadfadh víosa a bheith de dhíth ort chun teacht anseo agus caithfidh tú clárú leis na húdaráis inimirce

source: Your right to have your family come and live with you in Ireland depends on the type of permit you have
ga: Tá an ceart atá agat go mbeadh do theaghlach in ann teacht chun cónaí leat ag brath ar an gcineál ceada atá agat

source: You can find out about the residence rights of family members
ga: Is féidir leat fáil amach faoi chearta cónaitheachta na mball teaghlaigh

source: Protection for migrant workers
ga: Cosaint do oibrithe imirceacha

source: Foreign nationals who are legally working in Ireland have exactly the same rights under employment legislation as Irish working here
ga: Tá na cearta céanna ag náisiúnaigh choigríche atá ag obair go dleathach in Éirinn faoi chearta na reachtaíochta fostaíochta, agus atá ag Éireannaigh atá ag obair anseo

source: The new employment permit is given to the employee
ga: Tugtar an cead fostaíochta nua don fhostaí

source: The permit contains a statement of the rights and entitlements of the worker
ga: Áirítear ráiteas cearta agus teidlíochtaí an oibrithe sa chead

source: The statement of rights includes the information about when and how the worker may change employment
ga: Áirítear faisnéis sa ráiteas cearta faoi cén uair agus conas gur féidir leis an oibrí fostaíocht a athrú

source: The statement also includes details of pay, rights under the national minimum wage legislation and any deductions which it is proposed to make from that pay – for example, for accommodation
ga: Áirítear san ráiteas sonraí pá, cearta faoin reachtaíocht um pá íosta náisiúnta agus asbhaintí ar bith atá beartaithe a thógáil ón bpá sin – asbhaintí cóiríochta mar shampla

source: The national minimum wage legislation allows for certain deductions to be made from the statutory minimum pay of an employee if the employee is provided with board and/or lodgings
ga: Ceadaíonn an reachtaíocht um pá íosta náisiúnta d'asbhaintí áirithe a bheith déanta ón bpá íosta reachtúil ag fostaí, má tá iostas agus/nó lóistín soláthraithe don fhostaí

source: Employers are not allowed to deduct expenses associated with recruitment from the employee's pay and are not allowed retain any of the worker’s personal documents
ga: Ní cheadaítear d'fhostóirí costais a asbhaint ó phá an fhostaí a bhaineann le hearcaíocht agus ní cheadaítear dóibh doiciméid phearsanta an oibrí a choinneáil

source: Critical Skills Employment Permit: The fee for an application is €1,000
ga: Cead Fostaíochta Scileanna Ríthábhachtacha: Is é €1,000 an táille don iarratas

source: Fees for General Employment Permit applications and intra-company transfer:
ga: Táillí maidir le hiarratais an cheada fostaíochta agus aistriú laistigh de chuideachta:

source: For a period of up to 6 months €500
ga: │Tréimhse suas le 6 mhí │€500 │

source: For between 6 months and 2 years €1,000
ga: │Idir 6 mhí agus 2 bhliain │€1,000 │

source: Applications for employment permits can be made by you or your prospective employer to the Employment Permits Section of the Department of Jobs, Enterprise and Innovation using the Employment Permits Online System (EPOS)
ga: Is féidir leat féin nó d'fhostóir ionchasach iarratais a dhéanamh ar cheadanna fostaíochta trí Rannóg na gCeadanna Fostaíochta sa Roinn Post, Fiontar agus Nuálaíochta ag baint leasa as an gCóras Ceadanna Fostaíochta Ar Líne (CCFA)

source: If you are in Ireland and you need English translations of documents you can contact the embassy or consulate of your country for assistance
ga: Má tá tú in Éirinn agus is gá duit aistrithe Béarla cáipéisí, is féidir leat dul i dteagmháil leis an ambasáid nó consalacht de do thír féin chun cúnamh a fháil
